import 'package:myproject/gen/assets.gen.dart';

import 'data_module.dart';

Map homePagePosterMap = {
  'imageAsset': Assets.images.homePoster.path,
  'writerName': 'ملیکا عزیزی',
  'date': 'یک روز پیش',
  'articleView': '251',
  'headLine': 'دوازده قدم برنامه نویسی یک دوره ....'
};

List<HashTagModel> tagList = [
  HashTagModel(title: "جاوا"),
  HashTagModel(title: "کاتلین"),
  HashTagModel(title: "فلاتر"),
  HashTagModel(title: "برنامه نویسی وب"),
  HashTagModel(title: "هوش مصنوعی"),
  HashTagModel(title: "پایتون"),
  HashTagModel(title: "سی شارپ"),
];

List<BlogModel> blogList = [
  BlogModel(
      id: 1,
      posterImageUrl:
          'https://digiato.com/wp-content/uploads/2022/07/Call-of-Duty-Mobile-1.jpg',
      writerName: "ملیکا محمدی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      content:
          """پس از اینکه اعلام شد واتس‌اپ در حال توسعه برخی ویژگی‌های مهم مانند امکان ویرایش پیام‌ها است، این شرکت اکنون در حال کار روی قابلیت مخفی کردن وضعیت آنلاین کاربران در به‌رورسانی‌های آینده برنامه خود است.

همانطور که وب‌سایت WABetaInfo گزارش می‌دهد، واتس‌اپ سرانجام در حال توسعه قابلیتی برای کاربران خود است تا بتوانند وضعیت آنلاین بودن خود را فقط به برخی کاربران نشان دهند. طبق تصویر به اشتراک گذاشته شده از این قابلیت در حال توسعه، کاربران می‌توانند با ایجاد یک فهرست دلخواه، تعیین کنند که چه کسانی قادر خواهند بود تا از آنلاین بودن آن‌ها مطلع شوند.
""",
      date: "1401/04/11",
      view: '2530',
      title:
          "واتس اپ امکان مخفی کردن پیام ها را فعال میکندو این کار برای ما بسیار مفید و سودمن خواهد بود زیراکه در گذشته دیلدو سواری مرسوم بوده است"),
  BlogModel(
      id: 1,
      posterImageUrl:
          'https://digiato.com/wp-content/uploads/2022/07/i26_106565.jpeg',
      writerName: "ملیکا محمدی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      content:
          """پس از اینکه اعلام شد واتس‌اپ در حال توسعه برخی ویژگی‌های مهم مانند امکان ویرایش پیام‌ها است، این شرکت اکنون در حال کار روی قابلیت مخفی کردن وضعیت آنلاین کاربران در به‌رورسانی‌های آینده برنامه خود است.

همانطور که وب‌سایت WABetaInfo گزارش می‌دهد، واتس‌اپ سرانجام در حال توسعه قابلیتی برای کاربران خود است تا بتوانند وضعیت آنلاین بودن خود را فقط به برخی کاربران نشان دهند. طبق تصویر به اشتراک گذاشته شده از این قابلیت در حال توسعه، کاربران می‌توانند با ایجاد یک فهرست دلخواه، تعیین کنند که چه کسانی قادر خواهند بود تا از آنلاین بودن آن‌ها مطلع شوند.
""",
      date: "1401/04/11",
      view: '2530',
      title: "واتس اپ امکان مخفی کردن پیام ها را فعال میکند"),
  BlogModel(
      id: 1,
      posterImageUrl:
          'https://digiato.com/wp-content/uploads/2021/09/13-137487_clash-royale-hd-wallpaper-free-download-pc-computer-w1200.jpg',
      writerName: "ملیکا محمدی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      content:
          """پس از اینکه اعلام شد واتس‌اپ در حال توسعه برخی ویژگی‌های مهم مانند امکان ویرایش پیام‌ها است، این شرکت اکنون در حال کار روی قابلیت مخفی کردن وضعیت آنلاین کاربران در به‌رورسانی‌های آینده برنامه خود است.

همانطور که وب‌سایت WABetaInfo گزارش می‌دهد، واتس‌اپ سرانجام در حال توسعه قابلیتی برای کاربران خود است تا بتوانند وضعیت آنلاین بودن خود را فقط به برخی کاربران نشان دهند. طبق تصویر به اشتراک گذاشته شده از این قابلیت در حال توسعه، کاربران می‌توانند با ایجاد یک فهرست دلخواه، تعیین کنند که چه کسانی قادر خواهند بود تا از آنلاین بودن آن‌ها مطلع شوند.
""",
      date: "1401/04/11",
      view: '2530',
      title: "واتس اپ امکان مخفی کردن پیام ها را فعال میکند"),
  BlogModel(
      id: 1,
      posterImageUrl:
          'https://digiato.com/wp-content/uploads/2022/07/photo_2022-07-02_15-52-06.jpg',
      writerName: "ملیکا محمدی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      content:
          """پس از اینکه اعلام شد واتس‌اپ در حال توسعه برخی ویژگی‌های مهم مانند امکان ویرایش پیام‌ها است، این شرکت اکنون در حال کار روی قابلیت مخفی کردن وضعیت آنلاین کاربران در به‌رورسانی‌های آینده برنامه خود است.

همانطور که وب‌سایت WABetaInfo گزارش می‌دهد، واتس‌اپ سرانجام در حال توسعه قابلیتی برای کاربران خود است تا بتوانند وضعیت آنلاین بودن خود را فقط به برخی کاربران نشان دهند. طبق تصویر به اشتراک گذاشته شده از این قابلیت در حال توسعه، کاربران می‌توانند با ایجاد یک فهرست دلخواه، تعیین کنند که چه کسانی قادر خواهند بود تا از آنلاین بودن آن‌ها مطلع شوند.
""",
      date: "1401/04/11",
      view: '2530',
      title: "واتس اپ امکان مخفی کردن پیام ها را فعال میکند"),
  BlogModel(
      id: 1,
      posterImageUrl:
          'https://digiato.com/wp-content/uploads/2022/07/photo_2022-07-03_08-51-20.jpg',
      writerName: "ملیکا محمدی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      content:
          """پس از اینکه اعلام شد واتس‌اپ در حال توسعه برخی ویژگی‌های مهم مانند امکان ویرایش پیام‌ها است، این شرکت اکنون در حال کار روی قابلیت مخفی کردن وضعیت آنلاین کاربران در به‌رورسانی‌های آینده برنامه خود است.

همانطور که وب‌سایت WABetaInfo گزارش می‌دهد، واتس‌اپ سرانجام در حال توسعه قابلیتی برای کاربران خود است تا بتوانند وضعیت آنلاین بودن خود را فقط به برخی کاربران نشان دهند. طبق تصویر به اشتراک گذاشته شده از این قابلیت در حال توسعه، کاربران می‌توانند با ایجاد یک فهرست دلخواه، تعیین کنند که چه کسانی قادر خواهند بود تا از آنلاین بودن آن‌ها مطلع شوند.
""",
      date: "1401/04/11",
      view: '2530',
      title: "واتس اپ امکان مخفی کردن پیام ها را فعال میکند"),
  BlogModel(
      id: 1,
      posterImageUrl:
          'https://digiato.com/wp-content/uploads/2022/07/photo_2022-07-03_08-51-20.jpg',
      writerName: "ملیکا محمدی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      content:
          """پس از اینکه اعلام شد واتس‌اپ در حال توسعه برخی ویژگی‌های مهم مانند امکان ویرایش پیام‌ها است، این شرکت اکنون در حال کار روی قابلیت مخفی کردن وضعیت آنلاین کاربران در به‌رورسانی‌های آینده برنامه خود است.

همانطور که وب‌سایت WABetaInfo گزارش می‌دهد، واتس‌اپ سرانجام در حال توسعه قابلیتی برای کاربران خود است تا بتوانند وضعیت آنلاین بودن خود را فقط به برخی کاربران نشان دهند. طبق تصویر به اشتراک گذاشته شده از این قابلیت در حال توسعه، کاربران می‌توانند با ایجاد یک فهرست دلخواه، تعیین کنند که چه کسانی قادر خواهند بود تا از آنلاین بودن آن‌ها مطلع شوند.
""",
      date: "1401/04/11",
      view: '2530',
      title: "واتس اپ امکان مخفی کردن پیام ها را فعال میکند"),
  BlogModel(
      id: 1,
      posterImageUrl:
          'https://digiato.com/wp-content/uploads/2022/07/photo_2022-07-03_08-51-20.jpg',
      writerName: "ملیکا محمدی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      content:
          """پس از اینکه اعلام شد واتس‌اپ در حال توسعه برخی ویژگی‌های مهم مانند امکان ویرایش پیام‌ها است، این شرکت اکنون در حال کار روی قابلیت مخفی کردن وضعیت آنلاین کاربران در به‌رورسانی‌های آینده برنامه خود است.

همانطور که وب‌سایت WABetaInfo گزارش می‌دهد، واتس‌اپ سرانجام در حال توسعه قابلیتی برای کاربران خود است تا بتوانند وضعیت آنلاین بودن خود را فقط به برخی کاربران نشان دهند. طبق تصویر به اشتراک گذاشته شده از این قابلیت در حال توسعه، کاربران می‌توانند با ایجاد یک فهرست دلخواه، تعیین کنند که چه کسانی قادر خواهند بود تا از آنلاین بودن آن‌ها مطلع شوند.
""",
      date: "1401/04/11",
      view: '2530',
      title: "واتس اپ امکان مخفی کردن پیام ها را فعال میکند"),
  BlogModel(
      id: 1,
      posterImageUrl:
          'https://digiato.com/wp-content/uploads/2022/07/photo_2022-07-03_08-51-20.jpg',
      writerName: "ملیکا محمدی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      content:
          """پس از اینکه اعلام شد واتس‌اپ در حال توسعه برخی ویژگی‌های مهم مانند امکان ویرایش پیام‌ها است، این شرکت اکنون در حال کار روی قابلیت مخفی کردن وضعیت آنلاین کاربران در به‌رورسانی‌های آینده برنامه خود است.

همانطور که وب‌سایت WABetaInfo گزارش می‌دهد، واتس‌اپ سرانجام در حال توسعه قابلیتی برای کاربران خود است تا بتوانند وضعیت آنلاین بودن خود را فقط به برخی کاربران نشان دهند. طبق تصویر به اشتراک گذاشته شده از این قابلیت در حال توسعه، کاربران می‌توانند با ایجاد یک فهرست دلخواه، تعیین کنند که چه کسانی قادر خواهند بود تا از آنلاین بودن آن‌ها مطلع شوند.
""",
      date: "1401/04/11",
      view: '2530',
      title: "واتس اپ امکان مخفی کردن پیام ها را فعال میکند")
];

List<podCastModel> podCastList = [
  podCastModel(
      id: 1,
      imageUrl: 'https://fidibo.com/landings/podcast/assets/podcasts/bplus.jpg',
      title: "رمزون",
      view: '32502',
      date: '1401/04/13',
      speakerImageUrl: 'speakerImageUrl',
      speakerName: 'نگین عنایتی'),
  podCastModel(
      id: 1,
      imageUrl:
          'https://tehranpodcast.ir/wp-content/uploads/2022/06/1466152-240055-400x400.jpg',
      title: "رادیو کدیاد",
      view: '32502',
      date: '1401/04/13',
      speakerImageUrl: 'speakerImageUrl',
      speakerName: 'نگین عنایتی'),
  podCastModel(
      id: 1,
      imageUrl:
          'https://tehranpodcast.ir/wp-content/uploads/2022/06/3000-400x400.jpg',
      title: "تکنو آوا",
      view: '32502',
      date: '1401/04/13',
      speakerImageUrl: 'speakerImageUrl',
      speakerName: 'نگین عنایتی'),
  podCastModel(
      id: 1,
      imageUrl:
          'https://tehranpodcast.ir/wp-content/uploads/2022/06/havard12-FINAL-POSTER-400x400.png',
      title: "فلاتر کست",
      view: '32502',
      date: '1401/04/13',
      speakerImageUrl: 'speakerImageUrl',
      speakerName: 'نگین عنایتی'),
  podCastModel(
      id: 1,
      imageUrl:
          'https://tehranpodcast.ir/wp-content/uploads/2022/05/7c4f9b41e185d0e4e97d8d5554-400x400.jpg',
      title: "دیجی آوا",
      view: '32502',
      date: '1401/04/13',
      speakerImageUrl: 'speakerImageUrl',
      speakerName: 'نگین عنایتی'),
  podCastModel(
      id: 1,
      imageUrl:
          'https://tehranpodcast.ir/wp-content/uploads/2020/07/2533777-1571811333660-060d72f1b5cc9-400x400.jpg',
      title: "رمزون",
      view: '32502',
      date: '1401/04/13',
      speakerImageUrl: 'speakerImageUrl',
      speakerName: 'نگین عنایتی'),
];
